'''
Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел. У пользователя необходимо запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.
Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].
'''
rating = [7, 6, 5, 5, 5, 4, 3]

new_el = int(input('Введите новый элемент рейтинга: '))
if (new_el <= rating[-1]):
    rating.append(new_el)
for i, el in enumerate(rating):
    if (new_el > el):
        rating.insert(i, new_el)
        break

print(f'Новый рейтинг: {rating}')